# Homework 3

**Bootstrap and Testing**

1. Test the hypothesis that the survival rates for female passengers in Pclass 1 was no larger than in Pclass 2.
2. Create a boxplot `mpg ~ cylinders`. It does seem that the mpg for cars with 4 cylinders is quite different from those with 3 cylinders. What does a bootstrap test tell you about this hypothesis?
3. Can you think of more interesting hypotheses to test regarding the pregnancy data ?

In [1]:
%run ../ourFunctions.py

In [8]:
import pandas as pd
import numpy as np

# Test the hypothesis that the survival rates for female passengers in Pclass 1 was no larger than in Pclass 2.

In [2]:
#Titanic data:
import seaborn as sns
titanic = sns.load_dataset('titanic')

In [5]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [7]:
#fuilter df
titanic_FemPass12 = titanic[(titanic["pclass"]!=3) & (titanic["sex"]=="female") ]
titanic_FemPass12.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
15,1,2,female,55.0,0,0,16.0000,S,Second,woman,False,NaN,Southampton,yes,True

In [13]:
surv_1 = np.mean(titanic_FemPass12[titanic_FemPass12["pclass"]==1]["survived"])
surv_1

0.9680851063829787

In [29]:
surv_2 = np.mean(titanic_FemPass12[titanic_FemPass12["pclass"]==2]["survived"])
surv_2

0.9210526315789473

In [30]:
emp_mean_diff = surv_2-surv_1
emp_mean_diff

-0.04703247480403139

In [31]:
comm_mu = np.mean(titanic_FemPass12["survived"])
comm_mu

0.9470588235294117

In [32]:
# shift boths dist to common mean
Fem1_shifted = (titanic_FemPass12[titanic_FemPass12["pclass"]==1]["survived"]) - surv_1 + comm_mu
Fem2_shifted = (titanic_FemPass12[titanic_FemPass12["pclass"]==2]["survived"]) - surv_2 + comm_mu

In [33]:
bs_replicates_1 = draw_bs_reps(Fem1_shifted, np.mean, size=1000)
bs_replicates_2 = draw_bs_reps(Fem2_shifted, np.mean, size=1000)

In [34]:
bs_replicates = bs_replicates_2 - bs_replicates_1

pVal = np.mean(bs_replicates > emp_mean_diff)
pVal

0.907

# Auto data

In [3]:
#Auto data:
cars = pd.read_csv('../data/Auto.csv')